app/controllers/chores_controller.rb

SELECT * FROM "households" WHERE ("households"."id" = 1)
---
  def index
    @household = Household.find(params[:household_id])

SELECT * FROM "chores" WHERE ("chores"."id" = 1)
---
  def show
    @chore = Chore.find(params[:id])

SELECT * FROM "households" WHERE ("households"."id" = 1)
---
  def new
    @household = Household.find(params[:household_id])

SELECT * FROM "chores" WHERE ("chores"."id" = 1)
---
  def edit
    @chore = Chore.find(params[:id])

SELECT * FROM "households" WHERE ("households"."id" = 1)
INSERT INTO "chores" ("name", "on_wednesday", "updated_at", "on_tuesday", "on_saturday", "on_thursday", "on_monday", "on_sunday", "description", "duration", "on_friday", "household_id", "active", "created_at") VALUES('Chore 9', 'f', '2009-06-06 16:33:56', 't', 't', 't', 'f', 't', 'This is a description of a nasty chore', 15, 't', 1, 't', '2009-06-06 16:33:56')
INSERT INTO "households" ("name", "updated_at", "created_at") VALUES('Household 8', '2009-06-06 16:33:56', '2009-06-06 16:33:56')
---
  def create
    @household = Household.find(params[:household_id])
    @chore = @household.chores.new(params[:chore])

    respond_to do |format|
      if @chore.save

SELECT * FROM "chores" WHERE ("chores"."id" = 1)
UPDATE "chores" SET "on_saturday" = 't', "on_sunday" = 'f', "on_wednesday" = 'f', "name" = 'Chore 10', "on_tuesday" = 't', "on_monday" = 't', "updated_at" = '2009-06-06 17:20:41', "on_thursday" = 'f' WHERE "id" = 1
---
  def update
    @chore = Chore.find(params[:id])

    respond_to do |format|
      if @chore.update_attributes(params[:chore])

SELECT * FROM "chores" WHERE ("chores"."id" = 1)
DELETE FROM "chores" WHERE "id" = 1
---
  def destroy
    @chore = Chore.find(params[:id])
    @chore.destroy