app/controllers/households_controller.rb

SELECT * FROM "households" WHERE ("households"."id" = 1)
---
  def show
    @household = Household.find(params[:id])

SELECT * FROM "households" WHERE ("households"."id" = 1)
---
  def edit
    @household = Household.find(params[:id])

INSERT INTO "households" ("name", "updated_at", "created_at") VALUES('Household 8', '2009-06-06 16:02:53', '2009-06-06 16:02:53')
---
  def create
    @household = Household.new(params[:household])

    respond_to do |format|
      if @household.save

SELECT * FROM "households" WHERE ("households"."id" = 1)
UPDATE "households" SET "name" = 'Household 10', "updated_at" = '2009-06-06 16:02:53' WHERE "id" = 1
---
  def update
    @household = Household.find(params[:id])

    respond_to do |format|
      if @household.update_attributes(params[:household])

SELECT * FROM "households" WHERE ("households"."id" = 1)
DELETE FROM "households" WHERE "id" = 1
---
  def destroy
    @household = Household.find(params[:id])
    @household.destroy