app/controllers/members_controller.rb

  def show
    @member = Member.find(params[:id])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)

  def edit
    @member = Member.find(params[:id])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)

  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("updated_at", "area_code", "mobile_number", "manager", "first_name", "last_name", "household_id", "email", "created_at") VALUES('2009-06-06 18:03:28', 1, 1, 'f', 'MyString', 'MyString', 1, 'MyString', '2009-06-06 18:03:28')

  def update
    @member = Member.find(params[:id])

    respond_to do |format|
      if @member.update_attributes(params[:member])
---
SELECT * FROM "members" WHERE ("members"."id" = 1)
UPDATE "members" SET "email" = 'person_10@example.com', "mobile_number" = 5000010, "updated_at" = '2009-06-06 18:11:18' WHERE "id" = 1

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT * FROM "members" WHERE ("members"."id" = 1)
DELETE FROM "members" WHERE "id" = 1